PROJETO/NEUROCONTROL/app/controllers/api/auth_controller.rb

    def login
      username = params[:username]
      password = params[:password]

      if username.blank? || password.blank?
        render json: { error: 'Usuário e senha são obrigatórios.' }, status: :bad_request
        return
      end

      # Tenta buscar no banco novo (agendamentos_clinica_dev)
      user = LocalUser.find_by(username: username)
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'Marcus TI' LIMIT 1