PROJETO/NEUROCONTROL/app/controllers/api/gerencial_controller.rb

    def kpis
      mes_vigente = params[:mes_vigente]
      return render json: { error: 'O parâmetro mes_vigente é obrigatório.' }, status: :bad_request if mes_vigente.blank?

      guias = NeurocontrolGuia.joins(:paciente).where(mes_vigente: mes_vigente).select('neurocontrol_guias.*, pacientes.convenio_id')
---
SELECT neurocontrol_guias.*, pacientes.nome as paciente_nome, convenios.id as convenio_id, convenios.nome as convenio_nome, pacientes.planned_specialties FROM `neurocontrol_guias` JOIN pacientes ON pacientes.id = neurocontrol_guias.paciente_id JOIN convenios ON convenios.id = pacientes.convenio_id WHERE `neurocontrol_guias`.`mes_vigente` = '2026-07' ORDER BY `neurocontrol_guias`.`created_at` DESC

    def producao_convenio
      mes_vigente = params[:mes_vigente]
      return render json: { error: 'Parâmetro mes_vigente obrigatório.' }, status: :bad_request if mes_vigente.blank?

      guias = NeurocontrolGuia.joins(paciente: :convenio)
                              .where(mes_vigente: mes_vigente)
                              .select('neurocontrol_guias.*, convenios.nome as convenio_nome, convenios.id as convenio_id')
---
SELECT neurocontrol_guias.*, pacientes.nome as paciente_nome, convenios.id as convenio_id, convenios.nome as convenio_nome, pacientes.planned_specialties FROM `neurocontrol_guias` JOIN pacientes ON pacientes.id = neurocontrol_guias.paciente_id JOIN convenios ON convenios.id = pacientes.convenio_id WHERE `neurocontrol_guias`.`mes_vigente` = '2026-07' ORDER BY `neurocontrol_guias`.`created_at` DESC

    def excecoes
      excecoes = NeurocontrolGuia.joins(paciente: :convenio)
                                 .where(assinatura_pendente_flag: true)
                                 .select('neurocontrol_guias.*, pacientes.nome as paciente_nome, convenios.nome as convenio_nome')
                                 .order(updated_at: :desc)
---
SELECT neurocontrol_guias.*, pacientes.nome as paciente_nome, convenios.nome as convenio_nome FROM `neurocontrol_guias` INNER JOIN `pacientes` ON `pacientes`.`id` = `neurocontrol_guias`.`paciente_id` INNER JOIN `convenios` ON `convenios`.`id` = `pacientes`.`convenio_id` WHERE `neurocontrol_guias`.`assinatura_pendente_flag` = TRUE ORDER BY `neurocontrol_guias`.`updated_at` DESC

    def visao_consolidada
      mes_vigente = params[:mes_vigente].presence || Time.current.strftime('%Y-%m')
      dias_semana = %w[domingo segunda-feira terça-feira quarta-feira quinta-feira sexta-feira sábado]
      dia_semana_hoje = dias_semana[Time.current.wday]

      guias_mes = NeurocontrolGuia.where(mes_vigente: mes_vigente).count
      guias_ociosas = NeurocontrolGuia.where("status IN ('aguardando_agendamento', 'liberado_para_grade') AND TIMESTAMPDIFF(DAY, created_at, NOW()) >= 3").count
      aguardando_agenda = NeurocontrolGuia.where(status: %w[aguardando_agendamento liberado_para_grade]).count
      protocolos_em_transito = NeurocontrolProtocolo.where(status: 'pendente').count
      agendamentos_hoje = Agendamento.joins(:paciente).where(dia_semana: dia_semana_hoje, status: 'confirmado').where(pacientes: { deleted_at: nil }).count
      assinadas_hoje = NeurocontrolAssinaturaSessao.where(data_sessao: Date.today, status_assinatura: 'assinada').count
      alertas_recepcao = NeurocontrolAlerta.where(resolvido: [0, false]).count
      protocolos_para_auditar = NeurocontrolProtocolo.where(status: 'pendente').count
      guias_inconsistentes = NeurocontrolGuia.where(status: 'inconsistente').count
      overrides_sem_assinatura = NeurocontrolGuia.where(assinatura_pendente_flag: true).count
      guias_p_faturar = NeurocontrolGuia.where(status: 'p_faturar', mes_vigente: mes_vigente).count
---
SELECT COUNT(*) FROM `neurocontrol_guias` WHERE `neurocontrol_guias`.`mes_vigente` = '2026-07'
SELECT COUNT(*) FROM `neurocontrol_guias` WHERE (status IN ('aguardando_agendamento', 'liberado_para_grade') AND TIMESTAMPDIFF(DAY, created_at, NOW()) >= 3)
SELECT COUNT(*) FROM `neurocontrol_protocolos` WHERE `neurocontrol_protocolos`.`status` = 'pendente'
SELECT COUNT(*) FROM `agendamentos` INNER JOIN `pacientes` ON `pacientes`.`id` = `agendamentos`.`paciente_id` WHERE `agendamentos`.`dia_semana` = 'sexta-feira' AND `agendamentos`.`status` = 'confirmado' AND `pacientes`.`deleted_at` IS NULL
SELECT COUNT(*) FROM `neurocontrol_alertas` WHERE `neurocontrol_alertas`.`resolvido` IN (FALSE, FALSE)
SELECT COUNT(*) FROM `neurocontrol_guias` WHERE `neurocontrol_guias`.`assinatura_pendente_flag` = TRUE
SELECT COUNT(*) FROM `neurocontrol_guias` WHERE `neurocontrol_guias`.`status` = 'p_faturar' AND `neurocontrol_guias`.`mes_vigente` = '2026-07'