PROJETO/NEUROCONTROL/app/controllers/api/guias_controller.rb

SELECT `convenios`.`id`, `convenios`.`nome` FROM `convenios` ORDER BY `convenios`.`nome` ASC
---
    def convenios
      render json: Convenio.select(:id, :nome).order(:nome)