PROJETO/NEUROCONTROL/app/controllers/api/recepcao_controller.rb

    def hoje
      dia_semana_hoje = WEEKDAYS_PT[Time.current.wday]
      unidade = params[:unidade]
      mes_atual = Time.current.strftime('%Y-%m')

      agendamentos = Agendamento.joins(:paciente, :profissional)
                                .where(dia_semana: dia_semana_hoje, status: 'confirmado')
                                .where(pacientes: { deleted_at: nil })
---
SELECT agendamentos.id as agendamento_id, agendamentos.horario, agendamentos.dia_semana, pacientes.id as paciente_id, pacientes.nome as paciente_nome, profissionais.nome as profissional_nome, profissionais.especialidade, profissionais.unidade as profissional_unidade, profissionais.sala as profissional_sala FROM `agendamentos` INNER JOIN `pacientes` ON `pacientes`.`id` = `agendamentos`.`paciente_id` INNER JOIN `profissionais` ON `profissionais`.`id` = `agendamentos`.`profissional_id` WHERE `agendamentos`.`dia_semana` = 'domingo' AND `agendamentos`.`status` = 'confirmado' AND `pacientes`.`deleted_at` IS NULL ORDER BY agendamentos.horario ASC

    def alertas
      alertas = NeurocontrolAlerta.joins(:paciente)
                                  .where(resolvido: [0, false])
                                  .select('neurocontrol_alertas.*, pacientes.nome as paciente_nome')
                                  .order(id: :desc)
---
SELECT neurocontrol_alertas.*, pacientes.nome as paciente_nome FROM `neurocontrol_alertas` INNER JOIN `pacientes` ON `pacientes`.`id` = `neurocontrol_alertas`.`paciente_id` WHERE `neurocontrol_alertas`.`resolvido` IN (FALSE, FALSE) ORDER BY `neurocontrol_alertas`.`id` DESC